[{
        "qId": 1,
        "Questions": "What is your PINCODE?",
        "Parameters": "area_of_user",
        "Condition": "rural",
        "LegalTrainingMaterial": "\nIf the pincode belongs to rural \/ semi-urban district, then refer to the following:\n“Bank is well aware that I belong to a rural \/ semi-urban area where the financial literacy is assumed to be low, and customers from these areas are more susceptible to frauds. There is a heightened duty casted on the banks to implement robust technological solutions to protect the vulnerable customers especially those from rural \/ semi-urban areas from financial frauds. The bank should be called upon to demonstrate what additional technology and security parameters the bank has put in place to protect the customers from rural \/ semi-urban areas from the financial frauds.”\n"
    },
    {
        "qId": 2,
        "Questions": "Is the transaction a domestic transaction (i.e. where both payer\/originator and payee\/beneficiary are within India? ",
        "Parameters": "Domestic_or_Foregin_transaction",
        "Condition": "Yes",
        "LegalTrainingMaterial": null
    },
    {
        "qId": 3,
        "Questions": "Are you a senior citizen",
        "Parameters": "senior-citizen",
        "Condition": "Yes",
        "LegalTrainingMaterial": "Indian courts and the RBI have imposed heightened duty of care by banks towards senior citizens  as they are susceptible to deceit and trickery and are not expected to be adept with advanced technology and operations requiring technical knowledge and finesse. India law and RBI standards emphasise the importance of protective measures to be adopted by the banks (including procedural  technical and logical) for senior citizens who may not be as equipped to handle complex electronic banking interfaces or defend against fraudulent transactions employing deceptive tactics. This includes the responsibility to provide immediate assistance and take swift action in cases of reported failed transactions. It is very much possible that my case is not an isolated case  and the bank must have encountered many similar cases. It is on the bank to demonstrate what actions it has taken to deploy proactive tools and technology to protect the senior citizens."
    },
    {
        "qId": 4,
        "Questions": "Is the account from which the transaction was failed your pension savings account?",
        "Parameters": "pensionner",
        "Condition": "Yes",
        "LegalTrainingMaterial": "The duty of the bank gets further heightened when the bank is aware that the account is the pensioner account of a senior citizen, which is usually used by the senior citizens for their livelihood. RBI has time and again emphasised that senior citizens form an important constituent of the bank, and the entire trust of senior citizens in the banking systems will go down if the highly capitalised banks do not implement proactive and preventive technologies to safeguard the bank accounts of senior citizens especially where senior citizens receive their pensions to survive and sustain in the old age.”"
    },
    {
        "qId": 5,
        "Questions": "Which type of the transaction from the list below has failed?",
        "Parameters": "what_type_of_Fraud_has_happened",
        "Condition": "Automated Teller Machines",
        "LegalTrainingMaterial": "RBI has mandated the banks to immediately reverse the failed transactions within a maximum turn around time of T+5 days, and pay Rs. 100\/- per day as compensation for the delay. The bank has failed to comply with its obligations.The bank should also be asked to provide adequate proof of reconciliation records of the debit instructions with the actual cash dispensed from the cash chest of the ATM along with the relevant electronic records. The bank must be asked to produce the CCTV footage of my ATM withdrawal event which may reveal that no cash was dispensed by the ATM.In addition to the reversal and compensation for the delay, the bank should also be asked to pay an additional compensation for the interest that I have lost on the amount debited but cash not dispensed plus compensation for the harassment, fees I incurred in seeking the grievance redressal and for the mental agony."
    },
    {
        "qId": 6,
        "Questions": "Please select the nature of card transaction from the below list",
        "Parameters": "card_transcation",
        "Condition": "Card to card transfer",
        "LegalTrainingMaterial": "RBI has mandated the banks to immediately reverse the failed transactions within a maximum turn around time of T+1 day, and pay Rs. 100\/- per day as compensation for the delay. The bank has failed to comply with its obligations.The bank should also be asked to provide adequate proof of reconciliation and settlement records of the debit instructions with the actual credit along with the relevant electronic records.In addition to the reversal and compensation for the delay, the bank should also be asked to pay an additional compensation for the interest that I have lost on the amount debited but beneficiary account not credited plus compensation for the harassment, fees I incurred in"
    },
    {
        "qId": 7,
        "Questions": "Please select the nature of card transaction from the below list",
        "Parameters": "card_transcation",
        "Condition": "Point of Sale (PoS)",
        "LegalTrainingMaterial": "RBI has mandated the banks to immediately reverse the failed transactions within a maximum turn around time of T+5 days, and pay Rs. 100\/- per day as compensation for the delay. The bank has failed to comply with its obligations.The bank should also be asked to provide adequate proof of reconciliation and settlement records of the debit instructions with the actual credit along with the relevant electronic records.In addition to the reversal and compensation for the delay, the bank should also be asked to pay an additional compensation for the interest that I have lost on the amount debited but the merchant account is not credited plus compensation for the harassment, fees I incurred in seeking the grievance redressal and for the mental agony."
    },
    {
        "qId": 8,
        "Questions": "Please select the nature of card transaction from the below list",
        "Parameters": "card_transcation",
        "Condition": "Card Not Present",
        "LegalTrainingMaterial": "RBI has mandated the banks to immediately reverse the failed transactions within a maximum turn around time of T+5 days, and pay Rs. 100\/- per day as compensation for the delay. The bank has failed to comply with its obligations.\nIf the merchant account was credited or confirmation was received at the merchant system then the bank should also be asked to provide adequate proof of reconciliation and settlement records of the debit instructions with the actual credit and confirmation at the merchant system along with the relevant electronic records. The bank should also be asked to demonstrate that it has not received the money back from the merchant in the chargeback process.\nIn addition to the reversal and compensation for the delay, the bank should also be asked to pay an additional compensation for the interest that I have lost on the amount debited but the merchant account is not credited or confirmation not received at merchant’s system plus compensation for the harassment, fees I incurred in seeking the grievance redressal and for the mental agony."
    },
    {
        "qId": 9,
        "Questions": "Which type of the transaction from the list below has failed?",
        "Parameters": "what_type_of_Fraud_has_happened",
        "Condition": "Immediate Payment System (IMPS) transaction",
        "LegalTrainingMaterial": "RBI has mandated the banks to immediately reverse the failed transactions within a maximum turn around time of T+1 day, and pay Rs. 100\/- per day as compensation for the delay. The bank has failed to comply with its obligations.\nThe bank should also be asked to provide adequate proof of reconciliation and \nsettlement records of the debit instructions with the actual credit along with the relevant electronic records. \nIn addition to the reversal and compensation for the delay, the bank should also be asked to pay an additional compensation for the interest that I have lost on the amount debited but beneficiary account not credited plus compensation for the harassment, fees I incurred in seeking the grievance redressal and for the mental agony.\n"
    },
    {
        "qId": 10,
        "Questions": "Which type of UPI transaction:\n(a) person-to-person transaction (i.e. your account is debited but the beneficiary account is not credited), or \n(b) person to merchant transaction (i.e. your account is debited but transaction confirmation not received at merchant location)\nclick the button below",
        "Parameters": "UPI_transaction_type",
        "Condition": "person_to_person",
        "LegalTrainingMaterial": "RBI has mandated the banks to immediately reverse the failed transactions within a maximum turn around time of T+1 days, and pay Rs. 100\/- per day as compensation for the delay. The bank has failed to comply with its obligations. The bank should also be asked to prove that it did not breach the percentage threshold or technical or business declines set by NPCI, as this affects the confidence of the users in the UPI system.\n\nThe bank should also be asked to provide adequate proof of reconciliation and settlement records of the debit instructions with the actual credit along with the relevant electronic records. Further, the bank should be asked to also provide the details of whether the bank has received credit adjustment or return from the beneficiary bank, and has failed to reverse my account.being regulated by the RBI, for the reversal of the transaction and the bank is not permitted to pass on the onus of responsibility to UPI third party apps which are not regulated by RBI. Further, as per the UPI guidelines, banks cannot decline to process the transaction due to throttling if there is a different bank involved on the other side, as this goes against the spirit of UPI interoperability. Bank should be asked to prove that the bank did not decline the transaction due to throttling.\n\nIn addition to the reversal and compensation for the delay, the bank should also be asked to pay an additional compensation for the interest that I have lost on the amount debited but beneficiary account not credited plus compensation for the harassment, fees I incurred in seeking the grievance redressal and for the mental agony, especially when the UPI transaction decline is due to bank induced decline as per UPI guidelines.\n\n\nEven if the UPI third party apps are responsible for the failed transaction, the RBI guidelines hold the bank responsible,\n"
    },
    {
        "qId": 11,
        "Questions": "\"Which type of UPI transaction:\n(a) person-to-person transaction (i.e. your account is debited but the beneficiary account is not credited), or \n(b) person to merchant transaction (i.e. your account is debited but transaction confirmation not received at merchant location)\nclick the button below\"",
        "Parameters": "UPI_transaction_type",
        "Condition": "person_to_merchant",
        "LegalTrainingMaterial": "RBI has mandated the banks to immediately reverse the failed transactions within a maximum turn around time of T+5 days, and pay Rs. 100\/- per day as compensation for the delay. The bank has failed to comply with its obligations.\nThe bank should also be asked to provide adequate proof of reconciliation and settlement records of the debit instructions with the actual credit along with the relevant electronic records. \nEven if the UPI third party apps are responsible for the failed transaction, the RBI guidelines hold the bank responsible, being regulated by the RBI, for the reversal of the transaction and the bank is not permitted to pass on the onus of responsibility to UPI third party apps which are not regulated by RBI.\nIn addition to the reversal and compensation for the delay, the bank should also be asked to pay an additional compensation for the interest that I have lost on the amount debited but the merchant account not credited or the transaction confirmation was not received at the merchant location plus compensation for the harassment, fees I incurred in seeking the grievance redressal and for the mental agony.incurred in seeking the grievance redressal and for the mental agony."
    },
    {
        "qId": 12,
        "Questions": "Please select the relevant Aadhaar payment transaction:\n\n(a) EBS: Aadhaar Enabled Payment System including Aadhaar Pay i.e. your account is debited but transaction confirmation not received at merchant location or your account is debited but beneficiary account not credited.\n\n(b) PBS: Aadhaar Payment Bridge System i.e there is a delay in crediting beneficiary’s account",
        "Parameters": "EBS_PBS",
        "Condition": "EBS",
        "LegalTrainingMaterial": "RBI has mandated the banks to immediately reverse the failed transactions within a maximum turn around time of T+5 days, and pay Rs. 100\/- per day as compensation for the delay. The bank has failed to comply with its obligations.\nThe bank should also be asked to provide adequate proof of reconciliation and settlement records of the debit instructions with the actual credit along with the relevant electronic records. \nRBI guidelines hold the bank responsible, being regulated by the RBI, for the reversal of the transaction and the bank is not permitted to pass on the onus of responsibility to Aadhaar authority or UIDAI which are not regulated by RBI.\nIn addition to the reversal and compensation for the delay, the bank should also be asked to pay an additional compensation for the interest that I have lost on the amount debited but the \nmerchant account not credited or the transaction confirmation was not received at the merchant location plus compensation for the harassment, fees I incurred in seeking the grievance redressal and for the mental agony."
    },
    {
        "qId": 13,
        "Questions": "Please select the relevant Aadhaar payment transaction:\n\n(a) EBS: Aadhaar Enabled Payment System including Aadhaar Pay i.e. your account is debited but transaction confirmation not received at merchant location or your account is debited but beneficiary account not credited.\n\n(b) PBS: Aadhaar Payment Bridge System i.e there is a delay in crediting beneficiary’s account",
        "Parameters": "EBS_PBS",
        "Condition": "PBS",
        "LegalTrainingMaterial": "RBI has mandated the banks to immediately reverse the failed transactions within a maximum turn around time of T+5 days, and pay Rs. 100\/- per day as compensation for the delay. The bank has failed to comply with its obligations.\nThe bank should also be asked to provide adequate proof of reconciliation and settlement records of the debit instructions with the actual credit along with the relevant electronic records. \nRBI guidelines hold the bank responsible, being regulated by the RBI, for the reversal of the transaction and the bank is not permitted to pass on the onus of responsibility to Aadhaar authority or UIDAI which are not regulated by RBI.\nIn addition to the reversal and compensation for the delay, the bank should also be asked to pay an additional compensation for the interest that I have lost on the amount debited but the merchant account not credited or the transaction confirmation was not received at the merchant location plus compensation for the harassment, fees I incurred in seeking the grievance redressal and for the mental agony."
    },
    {
        "qId": 14,
        "Questions": "Is this an: \n(a) Off-Us transaction? i.e. you and the beneficiary (i.e. recipient) hold accounts with different banks, or\n(b) On-Us transaction? i.e. you and the beneficiary (i.e. recipient) hold accounts with same bank.",
        "Parameters": "different_bank",
        "Condition": "Off Us",
        "LegalTrainingMaterial": "RBI has mandated the wallet provider to immediately reverse the failed transactions within a maximum turn around time of T+5 days, and pay Rs. 100\/- per day as compensation for the delay. The wallet has failed to comply with its obligations.\nThe wallet provider should also be asked to provide adequate proof of reconciliation and settlement records of the debit instructions with the actual credit along with the relevant electronic records. \nIn addition to the reversal and compensation for the delay, the wallet provider should also be asked to pay an additional compensation for the interest that I have lost on the amount debited but beneficiary account not credited plus compensation for the harassment, fees I incurred in seeking the grievance redressal and for the mental agony.\n"
    },
    {
        "qId": 15,
        "Questions": "Does Beneficiary’s PPI not credited?",
        "Parameters": "Beneficiarys_PPI_not_credited",
        "Condition": "Yes",
        "LegalTrainingMaterial": "RBI has mandated the wallet provider to immediately reverse the failed transactions within a maximum turn around time of T+1 days, and pay Rs. 100\/- per day as compensation for the delay. The wallet has failed to comply with its obligations.\nThe wallet provider should also be asked to provide adequate proof of reconciliation and settlement records of the debit instructions with the actual credit along with the relevant electronic records. \nIn addition to the reversal and compensation for the delay, the wallet provider should also be asked to pay an additional compensation for the interest that I have lost on the amount debited but beneficiary account not credited plus compensation for the harassment, fees I incurred in seeking the grievance redressal and for the mental agony."
    },
    {
        "qId": 16,
        "Questions": "PPI debited but transaction confirmation not received at merchant location?",
        "Parameters": "ppi-debited-but-confirmation-not-received-at-merchant",
        "Condition": "Yes",
        "LegalTrainingMaterial": "RBI has mandated the wallet provider to immediately reverse the failed transactions within a maximum turn around time of T+1 days, and pay Rs. 100\/- per day as compensation for the delay. The wallet has failed to comply with its obligations.\nThe wallet provider should also be asked to provide adequate proof of reconciliation and settlement records of the debit instructions with the actual credit along with the relevant electronic records. \nIn addition to the reversal and compensation for the delay, the wallet provider should also be asked to pay an additional compensation for the interest that I have lost on the amount debited but beneficiary account not credited plus compensation for the harassment, fees I incurred in seeking the grievance redressal and for the mental agony."
    }
]